#pragma once
//=================================================================================
//	プログラム名	：	
//	処理			：	ビルボード処理[billboard.h]
//	メイン処理		：	main.cpp
//	作成者			：	moriya gaku
//=================================================================================

//=================================================================================
//	二重定義防止
//=================================================================================
#ifndef _BILLBOARD_H_
#define _BILLBOARD_H_

//=================================================================================
//	インクルードファイル
//=================================================================================
#include "main.h"
#include "scene3D.h"

class CBillboard : public CScene3D
{
public:
	CBillboard();											
	~CBillboard(){};											


	HRESULT Init( void );									
	void Uninit( void );									
	void Update( void );									
	void Draw( void );

private:
};

#endif