//=================================================================================
//	プログラム名	：	
//	処理			：	デバッグ用オブジェクト(モデル)処理[debugObj.cpp]
//	メイン処理		：	main.cpp
//	作成者			：	moriya gaku
//=================================================================================

//=================================================================================
//	インクルードファイル
//=================================================================================
#include "debugObj.h"
#include "manager.h"
#include "renderer.h"
#include "shader.h"
#include "model.h"
#include "sceneManager.h"
#include "textureManager.h"
#include "input.h"
#include "camera.h"

//=================================================================================
//	コンストラクタ
//=================================================================================
CDebugObj::CDebugObj()
{
}

//=================================================================================
//	デストラクタ
//=================================================================================
CDebugObj::~CDebugObj()
{
}

//=================================================================================
//	生成関数
//=================================================================================
CSceneX *CDebugObj::Create(const char* filename, string key)
{
	CSceneX *p = CSceneX::Create(filename);
	p->SetColor(COLOR_GRAY);
	p->SetScale(D3DXVECTOR3(1.0f, 1.0f, 1.0f));

	m_mpModelData.insert(DEBUG_OBJ_MAP::value_type(key, p));

	return p;
}

//=================================================================================
//	マップ捜索(データ取得)関数
//=================================================================================
CSceneX *CDebugObj::GetData(string key)
{
	// オブジェクトを検索
	DEBUG_OBJ_MAP::iterator it = m_mpModelData.find(key);

	if (it != m_mpModelData.end())
	{
		return it->second;
	}

	return NULL;
}

//=================================================================================
//	座標設定関数
//=================================================================================
void CDebugObj::SetPosition(string name, D3DXVECTOR3 pos)
{
	CSceneX *p = GetData(name);
	p->SetPosition(pos);
}

//=================================================================================
//　姿勢セット関数
//=================================================================================
void CDebugObj::SetRotMatrix(string name, D3DXMATRIX mtxRot)
{
	CSceneX *p = GetData(name);
	p->SetRotMatrix(mtxRot);
}

//=================================================================================
//　色設定関数
//=================================================================================
void CDebugObj::SetColor(string name, D3DXCOLOR col)
{
	CSceneX *p = GetData(name);
	p->SetColor(col);
}

//=================================================================================
//　大きさ設定関数
//=================================================================================
void CDebugObj::SetScale(string name, D3DXVECTOR3 scl)
{
	CSceneX *p = GetData(name);
	p->SetScale(scl);
}

//=================================================================================
//　終了関数
//=================================================================================
void CDebugObj::Uninit(void)
{
	m_mpModelData.clear();
}