#pragma once
//=================================================================================
//	プログラム名	：	
//	処理			：	モデル処理[model.h]
//	メイン処理		：	main.cpp
//	作成者			：	moriya gaku
//=================================================================================

//=================================================================================
//	二重定義防止
//=================================================================================
#ifndef _MODEL_H_
#define _MODEL_H_

class CModelData
{
public:
	CModelData() :pMesh(nullptr), pBuffMat(nullptr), nNumMat(0) {}

	~CModelData() {}

	LPD3DXMESH pMesh;		 // メッシュ情報へのポインタ
	LPD3DXBUFFER pBuffMat;	 // マテリアル情報へのポインタ
	DWORD nNumMat;			 // マテリアル情報の総数
};

#endif